[
  {
    "id": "joel-brauer",
    "name": "Joel Brauer",
    "birth": "18-Jun-1978",
    "death": "25-Apr-2013",
    "shortMemorial": "Joel was an amazing, one-of-a-kind Son, Husband, Nephew, Cousin, and Friend.",
    "fullObituary": "Joel Brauer was an extraordinary soul who touched the lives of everyone he met. Born on June 18, 1978, Joel brought joy, laughter, and warmth to his family and friends throughout his life. He was known for his generous spirit, quick wit, and unwavering loyalty to those he loved.\n\nJoel was a devoted son who always made time for family, no matter how busy life became. As a husband, he was caring and supportive, always putting his loved ones first. His role as a nephew and cousin was cherished by extended family members who looked forward to his visits and conversations.\n\nProfessionally, Joel was respected by his colleagues for his work ethic and integrity. He approached every challenge with determination and a positive attitude that inspired others. His friends remember him as someone who could be counted on in any situation, offering support, advice, or simply a listening ear.\n\nJoel's passing on April 25, 2013, left a void in the hearts of all who knew him. His memory lives on through the countless lives he touched and the love he shared with everyone around him.",
    "hasVideoGallery": false
  },
  {
    "id": "delbert-gennetten",
    "name": "Delbert Donald Gennetten",
    "birth": "15-Jan-1927",
    "death": "11-Apr-2017",
    "shortMemorial": "Delbert was a truly remarkable Husband, Father, Grandfather, and Friend. Together with Virginia, they have created an enduring legacy.",
    "fullObituary": "Celebrating the life of Delbert Donald Gennetten, a beloved husband, father, grandfather, brother, friend, and faithful servant of God. He was a man of courage, kindness, generosity, and wisdom, who touched the lives of many with his smile, his humor, and his faith, and his ability to fix most anything.\n\nDelbert was not born into an easy life, but he never let that stop him from pursuing his dreams and finding his purpose. He learned from an early age the value of hard work, perseverance, and gratitude. He often told us how he prayed to God for a good wife and a loving family, and how God answered his prayer in a miraculous way.\n\nHis idea to hitchhike his way to Oregon turned out to be the best idea he ever had, because that's where he met the love of his life, Virginia Gardner. They were inseparable from the moment they laid eyes on each other, and they shared a bond that lasted for more than 60 years. They raised four wonderful children, who gave them many grandchildren and great-grandchildren, who were the joy of their lives.\n\nDelbert was a man of vision and ambition, who always sought to improve himself and his situation. He took his family to College Place, where he became one of the first graduates of Electrical Engineering at Walla Walla College. He was a pioneer in his field, who worked on many projects and inventions that made a difference in the world. He was also a man of service, who used his skills and talents to help others, especially his church and his community.\n\nDelbert faced many challenges and trials in his life, but he never lost his faith or his hope. He battled Multiple Myeloma, a cancer that took a toll on his body, but not on his spirit. He gave credit to his wife for keeping him healthy and happy, with her delicious food and her constant care. He also gave credit to God for giving him strength and peace, and for showing him glimpses of the glorious future that awaits him.",
    "hasVideoGallery": true
  },
  {
    "id": "virginia-gennetten",
    "name": "Dorothy Virginia Gennetten",
    "birth": "18-Nov-1928",
    "death": "21-May-2020",
    "shortMemorial": "Virginia was an amazing Mother, Grandmother, Wife, and Friend.",
    "fullObituary": "Dorothy Virginia Gennetten was a woman of extraordinary grace, strength, and love who dedicated her life to nurturing and caring for others. Born on November 18, 1928, Virginia embodied the very best qualities of motherhood, partnership, and friendship.\n\nAs a mother, Virginia was the heart of her family. She created a warm, loving home where her children felt safe, valued, and encouraged to pursue their dreams. Her gentle guidance and unwavering support shaped the lives of her children and set the foundation for the strong family bonds that continue today.\n\nAs a wife to Delbert, Virginia was a true partner in every sense of the word. Their love story spanned more than six decades, built on mutual respect, shared values, and an unbreakable bond. Together, they faced life's challenges with courage and celebrated its joys with gratitude. Virginia's devotion to her husband was evident in every aspect of their life together.\n\nAs a grandmother, Virginia found immense joy in watching her grandchildren grow and flourish. She was actively involved in their lives, creating precious memories and passing down family traditions. Her love for her grandchildren was boundless, and they, in turn, adored their grandmother's gentle spirit and caring nature.\n\nVirginia's passing on May 21, 2020, marked the end of an era for her family. Her legacy lives on through the values she instilled, the love she shared, and the countless lives she touched throughout her remarkable journey.",
    "hasVideoGallery": true
  },
  {
    "id": "nami-gennetten",
    "name": "Nami-Yun (\"Nami\") Gennetten",
    "birth": "23-Aug-1955",
    "death": "07-Apr-2023",
    "shortMemorial": "Nami was a loving and devoted wife, mother and grandmother to her husband, sons, stepson, and grandsons.",
    "fullObituary": "Nami-Yun Gennetten, known lovingly as Nami, was a woman whose life was defined by love, devotion, and the profound impact she had on her family. Born on August 23, 1955, Nami brought warmth, compassion, and joy to everyone who had the privilege of knowing her.\n\nAs a wife, Nami was a true companion and partner. Her marriage was built on love, respect, and shared dreams. She stood by her husband through all of life's seasons, offering unwavering support and creating a home filled with love and laughter. Her devotion was evident in the small daily acts of kindness and the grand gestures of love that characterized their relationship.\n\nNami's role as a mother was central to her identity. She raised her sons with patience, wisdom, and boundless love, instilling in them the values that would guide them throughout their lives. Her stepson was welcomed with the same unconditional love, truly making their family complete. Nami had the rare gift of making each child feel special and valued.\n\nAs a grandmother, Nami found her greatest joy. Her grandsons were the light of her life, and she cherished every moment spent with them. Whether sharing stories, teaching life lessons, or simply being present for their achievements and challenges, Nami was the kind of grandmother who created lasting memories and deep bonds.\n\nNami's passing on April 7, 2023, left a profound void in the hearts of all who loved her. Her legacy continues through the family she nurtured and the love she shared so generously throughout her life.",
    "hasVideoGallery": false
  },
  {
    "id": "judy-wesslen",
    "name": "Judith Gaylene (Gennetten) Wesslen",
    "birth": "17-Sep-1950",
    "death": "18-Dec-2023",
    "shortMemorial": "Our latest family loss, Judy was extraordinary. A loving wife, sister, mother, grandmother, friend, and benevolent philanthropist.",
    "fullObituary": "Judy Wesslen, a beacon of love and resilience, graced this world on September 17, 1950, in Portland, Oregon. As the eldest of four siblings born to Delbert and Virginia Gennetten, she helped embody the spirit of a quintessential 1950's family—a snapshot of postcard-perfect moments.\n\nHer vivacity knew no bounds, often accompanied by a mischievous glint in her eye. But life took an unexpected turn when, at the tender age of 10, Judy fell victim to a drunk driver. The resulting injuries marked the beginning of a lifelong battle with medical challenges—a burden she carried with grace and determination.\n\nJudy's journey led her to college, where she initially pursued pre-med studies. However, fate had other plans. She met Jerry Wesslen, and their love story unfolded against the backdrop of Spokane, Washington, where together, they painted a life rich in love, laughter, and profound purpose.\n\nJudy is survived by two remarkable children, Jodi and Jeff, who, along with husband Jerry, stand as living testaments to her unwavering love. But Judy's heart knew no bounds; she welcomed several other children into her home, weaving a tapestry of compassion and belonging.\n\nGenerosity flowed through Judy's veins. Her involvement with missions spanned continents—from Maranatha Volunteers International to The Judy Wesslen Memorial Children's Home, an Ethiopian home for orphaned children. It is there, amidst the laughter and resilience of those little souls, that Judy's spirit found its wings. A new expansion now bears her name—a tribute to her boundless love and tireless efforts.\n\nAs we bid farewell to Judy, let us remember her as a giver, a fighter, and a beacon of light. Her legacy lives on, etched in the hearts of those she touched—a legacy of love that transcends time and space. Rest in peace, dear Judy, knowing that your kindness echoes through eternity.",
    "hasVideoGallery": false
  }
]